BEGIN TRANSACTION;
CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    job_title TEXT,
    basic_salary REAL,
    housing_allowance REAL,
    transport_allowance REAL,
    total_salary REAL,
    working_days INTEGER,
    gross_salary REAL,
    total_cost REAL,
    month TEXT,
    po_number TEXT
);
INSERT INTO "employees" ("id","name","job_title","basic_salary","housing_allowance","transport_allowance","total_salary","working_days","gross_salary","total_cost","month","po_number") VALUES (1,'عبدالرزاق الفيفي','مدير الأمانة',104999.0,19444.0,7777.0,104999.0,30,104999.0,133690.0,'نوفمبر 2025','4400017633'),
 (2,'عبدالله اليوسف','أمين لجنة',29999.0,5555.0,2222.0,29999.0,30,29999.0,40161.0,'نوفمبر 2025','4400017633'),
 (3,'فيصل العبيدان','محلل أنظمة',47445.0,8890.0,3555.0,47445.0,30,47445.0,61761.0,'نوفمبر 2025','4400017633'),
 (4,'عبدالعزيز الحمادي','أمين لجنة',17000.0,3148.0,1259.0,17000.0,30,17000.0,23507.0,'نوفمبر 2025','4400017633'),
 (5,'زينب الشمري','مصمم جرافيك',12285.0,2275.0,910.0,12285.0,30,12285.0,16768.0,'نوفمبر 2025','4400017633'),
 (6,'سارة البدر','منسق اداري',12000.0,2222.0,888.0,12000.0,30,12000.0,15415.0,'نوفمبر 2025','4400017633'),
 (7,'عبدالرزاق الفيفي','مدير الأمانة',104999.0,19444.0,7777.0,104999.0,30,104999.0,133690.0,'أكتوبر 2025','4400017633'),
 (8,'عبدالله اليوسف','أمين لجنة',29999.0,5555.0,2222.0,29999.0,30,29999.0,40161.0,'أكتوبر 2025','4400017633'),
 (9,'فيصل العبيدان','محلل أنظمة',47445.0,8890.0,3555.0,47445.0,30,47445.0,61761.0,'أكتوبر 2025','4400017633'),
 (10,'عبدالعزيز الحمادي','أمين لجنة',17000.0,3148.0,1259.0,17000.0,30,17000.0,23507.0,'أكتوبر 2025','4400017633'),
 (11,'زينب الشمري','مصمم جرافيك',12285.0,2275.0,910.0,12285.0,30,12285.0,16768.0,'أكتوبر 2025','4400017633'),
 (12,'سارة البدر','منسق اداري',12000.0,2222.0,888.0,12000.0,30,12000.0,15415.0,'أكتوبر 2025','4400017633'),
 (13,'عبدالله اليوسف','أمين لجنة',29999.0,5555.0,2222.0,29999.0,30,29999.0,40161.0,'ديسمبر 2025','4400017633'),
 (14,'فيصل العبيدان','محلل أنظمة',47445.0,8890.0,3555.0,47445.0,30,47445.0,61761.0,'ديسمبر 2025','4400017633'),
 (15,'عبدالعزيز الحمادي','أمين لجنة',17000.0,3148.0,1259.0,17000.0,30,17000.0,23507.0,'ديسمبر 2025','4400017633'),
 (16,'زينب الشمري','مصمم جرافيك',12285.0,2275.0,910.0,12285.0,36,14742.0,20121.0,'ديسمبر 2025','4400017633'),
 (17,'سارة البدر','منسق اداري',12000.0,2222.0,888.0,12000.0,30,12000.0,15415.0,'ديسمبر 2025','4400017633');
COMMIT;
